Repository: iondv/projects-i18n
Catalog: locales/*/framework.po
Languages: ru

source: User registration failed!
ru: Не удалось зарегистрировать пользователя!

source: %s objects processed
ru: %s объектов обработано

source: Cache recalculation started
ru: Пересчет кэша запущен

source: Recalculating objects of class %s
ru: Пересчет объектов класса %s

source: Recalculation complete!
ru: Пересчет завершен!

source: Theme %s not found
ru: Тема %s не найдена

source: Using theme from %s
ru: Использование темы из %s

source: Application %s deployment
ru: Развертывание приложения %s

source: Application deployment script started
ru: Скрипт развертывания приложения запущен

source: Failed to read deployment configuration.
ru: Не удалось прочитать конфигурацию развертывания.

source: Failed to refer dependecy components
ru: Не удалось обратиться к компонентам зависимостей

source: Required fields are not set.
ru: Обязательные поля не заполнены.

source: View model for workflow status %s.%s is placed into "workflows" directory instead of "wfviews" directory. That way is deprecated and will be removed later versions.
ru: Просмотр модели состояния бизнес-процесса %s. %s помещен в директорию "workflows" вместо директории "wfviews". Этот способ устарел и будет удален в более поздних версиях.

source: Failed to interpret view model path %s!
ru: Не удалось интерпретировать путь модели представления %s!

source: Exporting class %s
ru: Экспорт класса %s

source: Export of meta model.
ru: Экспорт метамодели.

source: Exporting data for class %s
ru: Экспорт данных для класса %s

source: Exporting named sequences
ru: Экспорт именованных последовательностей

source: Exporting ACL
ru: Экспорт ACL

source: Resource %s[%s] registered.
ru: Ресурс %s[%s] зарегистрирован.

source: Role %s[%s] registered.
ru: Роль %s[%s] зарегистрирована.

source: Role %s permissions to resource %s granted.
ru: Разрешения для ролей %s для ресурса %s предоставлены.

source: User %s registered.
ru: Пользователь %s зарегистрирован.

source: Roles assigned to user %s.
ru: Роли назначены пользователю %s.

source: File %s import.
ru: Импорт файла %s

source: File %s was not imported.
ru: Файл %s не импортирован.

source: ACL import complete.
ru: Импорт ACL завершен.

source: Specified ACL settings directory does not exist.
ru: Указанный каталог настроек ACL не существует.

source: Component for RBAC is not specified.
ru: Компонент для RBAC не указан.

source: Processed %d of %d objects
ru: Обработано %d из %d объектов

source: Error on file %s unpacking
ru: Ошибка при распаковке файла %s

source: Archive %s read
ru: Архив %s прочитан

source: Imported %d/%d objects from archive %s
ru: Импортировано %d/%d объектов из архива %s

source: Error on unpacking file %s
ru: Ошибка при распаковке файла %s

source: Objects imported from archive %s.
ru: Объекты импортированные из архива %s.

source: data objects for import quantity %d, archive quantity %d
ru: Количество объектов данных для импорта %d, архива %d

source: Error on parsing %s Assuming empty %s
ru: Ошибка при парсинге %s Предположительно пусто %s

source: Failed to connect to port %s
ru: Не удалось подключиться к порту %s

source: Failed to start server. All specified ports are busy.
ru: Не удалось запустить сервер. Все указанные порты заняты.

source: Loading module %s
ru: Загрузка модуля %s

source: Module %s loaded.
ru: Модуль %s загружен.

source: Starting ION application
ru: Запуск приложения ION

source: Default module not specified.
ru: Модуль по умолчанию не указан.

source: Loading web-modules.
ru: Загрузка веб-модулей.

source: Module %s is not an express.js application.
ru: Модуль %s не является приложением express.js.

source: All modules are loaded.
ru: Все модули загружены.

source: Listening to conveyer %s
ru: Слушается конвейер %s

source: Listening to port %s
ru: Слушается порт %s

source: Settings for session storage are not specified.
ru: Параметры session storage не указаны.

source: Specified session storage type is not supported!
ru: Указанный тип session storage не поддерживается!

source: Component %s not found.
ru: Компонент %s не найден.

source: Component %s has a cyclic reference to another component.
ru: Компонент %s имеет циклическую ссылку на другой компонент.

source: Method %s of component %s not found.
ru: Метод %s компонента %s не найден.

source: Failed to send notifications to those emails: %s
ru: Не удалось отправить уведомления на следующие e-mail: %s

source: Failed to send notification to email %s
ru: Не удалось отправить уведомление на e-mail %s

source: Notification sending to %s failed
ru: Не удалось отправить уведомление %s

source: Failed to send notification
ru: Не удалось отправить уведомление

source: Failed to revoke notification %s
ru: Не удалось отменить уведомление %s

source: Datasource not specified for changelogger factory!
ru: Источник данных не указан для журнала изменений!

source: Invalid changelog journal record type specified!
ru: Указан недопустимый тип записи журнала изменений!

source: Meta repository data source not specified!
ru: Не указан источник данных мета репозитория!

source: Async calls are not valid in selection lists conditions!
ru: Асинхронные вызовы недопустимы в условиях списков выбора!

source: Class [%s] for structure [%s].[%s] not found.
ru: Класс [%s] для структуры [%s].[%s] не найден.

source: Parent class "%s" for class %s not found.
ru: Родительский класс "%s" для класса %s не найден.

source: Class "%s" for reference attribute %s.%s not found.
ru: Класс "%s" для ссылочного атрибута %s.%s не найден.

source: Calculated attribute "%s" formula is specified as string.
ru: Формула вычисляемого атрибута "%s" задается в виде строки.

source: This format is deprecated and wil be removed from later versions.
ru: Этот формат устарел и будет удален из более поздних версий.

source: Invalid formula for calculated attribute "%s.%s": %s
ru: Недопустимая формула для вычисляемого атрибута "%s.%s": %s

source: Attribute "%s" default value formula is specified as string.
ru: Значение формулы атрибута "%s" по умолчанию задается в виде строки.

source: Workflow %s was not initialized!
ru: Бизнес-процесс %s не был инициализирован!

source: Attribute %s of class %s not found!
ru: Атрибут %s класса %s не найден!

source: Class %s not found!
ru: Класс %s не найден!

source: Attribute %s specified in composite index not found in class "%s (%s)".
ru: Атрибут %s , указанный в составном индексе, не найден в классе "%s (%s)".

source: Class %s registered.
ru: Класс %s зарегистрирован.

source: Several objects match back reference "%s"
ru: Несколько объектов соответствуют обратной ссылке "%s"

source: Objects of class "%s" are not valid for reference "%s.%s".
ru: Объекты класса "%s" недопустимы для ссылки "%s.%s".

source: Saved object integrity check failed
ru: Ошибка проверки целостности сохраненного объекта

source: Object "%s@%s" was onlinked from object "%s@%s".
ru: Объект "%s@%s" был отключен от объекта "%s@%s".

source: Previous object referenced by attribute "%s.%s" can not be unlinked. Back reference was not assigned.
ru: Связь с предыдущим объектом, на который ссылается атрибут "%s.%s" не может быть разорвана. Обратная ссылка не была назначена.

source: Abstract class can not be instantiated!
ru: Невозможно создать экземпляр абстрактного класса!

source: Object was not found after creation.
ru: Объект не был найден после создания.

source: Object of class "%s" are invalid in collection "%s.%s".
ru: Объект класса "%s" недопустим в коллекции "%s.%s".

source: Objects of class "%s" are invalid in collection "%s.%s".
ru: Объекты класса "%s" недопустимы в коллекции "%s.%s".

source: Attribute %s of class %s was not found on ABAC check
ru: Атрибут %s класса %s не был найден при проверке ABAC

source: Memcached servers accessibility check done.
ru: Проверка доступности серверов Memcached выполнена.

source: Memcached server %s is not accessible.
ru: Сервер Memcached %s недоступен.

source: Memcached repository initialization...
ru: Инициализация репозитория Memcached...

source: Redis repository initialization
ru: Инициализация репозитория Redis

source: Redis repository connected
ru: Репозиторий Redis подключен

source: Datasource of aggregation is not specified!
ru: Источник данных агрегации не указан!

source: Syntax error in formula fragment "%s".
ru: Синтаксическая ошибка во фрагменте формулы "%s".

source: Syntax error in expression "%s": bracket not closed
ru: Синтаксическая ошибка в выражении "%s": скобка не закрыта

source: Syntax error in formula fragment "%s"
ru: Синтаксическая ошибка во фрагменте формулы "%s"

source: Function %s not found
ru: Функция %s не найдена

source: Sequence name not specified!
ru: Имя последовательности не указано!

source: Nescessary arguments are not specified for fetch function!
ru: Hе указаны необходимые аргументы для функции fetch!

source: Connection to database server parameters are not specified.
ru: Параметры подключения к серверу базы данных не заданы.

source: Connected to database: %s
ru: Подключено к базе данных: %s

source: Invalid date interval type specified!
ru: Указан недопустимый тип интервала дат!

source: LIKE operation cannot be used for result set field expression.
ru: Операция LIKE не может быть использована для выбранного набора выражений.

source: Attribute list nescessary for performing join is not specified.
ru: Список атрибутов, необходимых для выполнения соединения, не указан.

source: Data source not specified for ACL subsytem!
ru: Источник данных не указан для подсистемы ACL!

source: Failed to initialize ACL subsystem.
ru: Не удалось инициализировать подсистему ACL.

source: Password not specified
ru: Пароль не указан

source: Failed to change password!
ru: Не удалось сменить пароль!

source: New password is the same as previous!
ru: Новый пароль совпадает с предыдущим!

source: Wrong password
ru: Неправильный пароль

source: Wrong password.
ru: Неправильный пароль.

source: File storage data source not specified!
ru: Источник данных для файлового хранилища не указан!

source: Inapropriate data type received!
ru: Получен несоответствующий тип данных!

source: No such directory %s
ru: Каталог %s не существует

source: Base URL for share is not set up!
ru: Базовый URL для общего доступа не настроен!

source: Invalid Owncloud server response
ru: Недопустимый ответ сервера Owncloud

source: Unknown result of operation
ru: Неизвестный результат операции

source: Connection parameters (url, login, password) are not specified.
ru: Параметры подключения (url, логин, пароль) не указаны.

source: Invalid access level value!
ru: Недопустимое значение уровня доступа!

source: Invalid share address specified.
ru: Указан недействительный адрес общего доступа.

source: Mandatory fields (shareType, path) not specified
ru: Обязательные поля (shareType, путь) не указаны

source: OwnCloud connection parameters (url, login, password) are not specified.
ru: Параметры подключения ownCloud (url, логин, пароль) не указаны.

source: Failed to obtain file from remote storage! Error code (%s).
ru: Не удалось получить файл из удаленного хранилища! Код ошибки (%s).

source: Empty response, status: %s
ru: Пустой ответ, статус: %s

source: No data to put into storage.
ru: Нет данных для хранения.

source: Data of inapropriate type received!
ru: Получены данные несоответствующего типа!

source: Invalid path to directory specified.
ru: Указан неверный путь к каталогу.

source: Datasource is not set up.
ru: Источник данных не настроен.

source: Fetch parameters are not specified!
ru: Параметры выборки не указаны!

source: Job %s not found in the configuration
ru: Задание %s не найдено в конфигурации

source: Invalid job parameters specified.
ru: Указаны недопустимые параметры задания.

source: Connecting datasources
ru: Подключение источников данных

source: All datasources successfully disconnected!
ru: Все источники данных успешно отключены!

source: Error message base does not exist in path "%s"
ru: База сообщений об ошибках не существует в path "%s"

source: Attribute %s of class %s not found
ru: Атрибут %s класса %s не найден

source: Attribute "%s" of class "%s" not found!
ru: Атрибут "%s" класса "%s" не найден!

source: Invalid data
ru: Неверные данные

source: Conditions for collections based on composite keys are not supported yet!
ru: Условия для коллекций на основе составных ключей пока не поддерживаются!

source: Operation %s is not applicable to attribute %s of class %s
ru: Операция %s не применима к атрибуту %s класса %s

source: Failed to obtain file reading stream.
ru: Не удалось получить поток чтения из файла.

source: Function for getting file input stream not specified.
ru: Функция получения входного потока из файла не указана.

source: Changelog record fetch criteria not specified
ru: Критерии выборки записей журнала изменений не указаны

source: Interval should be specified as Date instance!
ru: Интервал должен быть указан как Дата!

source: Home
ru: Главная страница

source: Login
ru: Логин

source: Password
ru: Пароль

source: Repeat password
ru: Повторите пароль

source: Sign in
ru: Войти

source: Sign in form
ru: Форма авторизации

source: Sign up
ru: Зарегистрироваться

source: Enter
ru: Ввод

source: Password change form
ru: Форма смены пароля

source: New password
ru: Новый пароль

source: Change password
ru: Смените пароль

source: OAuth2 access request
ru: Запрос доступа OAuth2

source: Application %app claims access with your account
ru: Приложение %app запрашивает доступ к вашему аккаунту

source: Grant access
ru: Предоставить доступ

source: Deny access
ru: Запретить доступ

source: User %name profile
ru: Профиль пользователя %name

source: Save
ru: Сохранить

source: Back to application
ru: Вернуться к приложению

source: Language
ru: Язык

source: Sign up form
ru: Форма регистрации

source: Authentication datasource is not set up.
ru: Источник данных аутентификации не настроен.

source: You dont have enough permissions to login.
ru: У вас недостаточно разрешений для входа.

source: Account is blocked till %d
ru: Аккаунт заблокирован до %d

source: Failed to sign in.
ru: Не удалось войти.

source: Account is not secured with password.
ru: Учетная запись не защищена паролем.

source: Sign in is temporary unavailable due to technical reasons.
ru: Вход временно недоступен по техническим причинам.

source: User password not specified
ru: Пароль пользователя не указан

source: Internal server error
ru: Внутренняя ошибка сервера

source: Wrong password repeat!
ru: Повтор неверного пароля!

source: Minimal password length is %p symbols
ru: Минимальная длина пароля - %p символов

source: Using one of %p previous passwords is prohibited.
ru: Запрещено использование одного из %p предыдущих паролей.

source: Password too weak. Password should contain
ru: Слишком слабый пароль. Пароль должен содержать

source: letters in lower and upper case
ru: буквы в нижнем и верхнем регистре

source: numbers
ru: цифры

source: special symbols (@, $, & etc.)
ru: специальные символы (@, $, & etc.)

source: and
ru: и

source: Public sign up is prohibited!
ru: Публичная регистрация запрещена!

source: User sign up failed!
ru: Регистрация пользователя не удалась!

source: Failed to edit user profile!
ru: Не удалось отредактировать профиль пользователя!

source: Password change prohibition period was not ended.
ru: Период запрета на смену пароля не закончился.

source: User was not authenicated.
ru: Пользователь не прошел аутентификацию.

source: User is blocked.
ru: Пользователь заблокирован.

source: Failed to determine user id.
ru: Не удалось определить идентификатор пользователя.

source: Failed to sign up user from external system.
ru: Не удалось зарегистрировать пользователя из внешней системы.

source: No strategy specified for passport %nm
ru: Для паспорта %nm не указана стратегия

source: %class with this '%attr' value already exists.
ru: %class с этим '%attr' значением уже существует.

source: %class having same values of '%attr' already exists.
ru: %class с такими же значениями '%attr' уже существует.

source: Object '%info' not found.
ru: Объект '%info' не найден.

source: Object '%info' is aleady in collection '%col'.
ru: Объект '%info' уже находится в коллекции '%col'.

source: Invalid parameters specified for method '%method'.
ru: Указаны недопустимые параметры для метода '%method'.

source: Failed to save data to file attribute '%attr' of object '%info'.
ru: Не удалось сохранить данные в файл атрибута '%attr' объекта '%info'.

source: Failed to load file attribute '%attr'.
ru: Не удалось загрузить атрибут файла '%attr'.

source: collection '%attr' is abscent in object %info.
ru: Коллекция '%attr' отсутствует в объекте %info.

source: Error in meta-model of object '%info'.
ru: Ошибка в метамодели объекта '%info'.

source: Using complex keys in operation '%oper' is not supported yet.
ru: Использование сложных ключей в операции '%oper' пока не поддерживается.

source: '%operation' action was not applied to object '%info'.
ru: Действие '%operation' не было применено к объекту '%info'.

source: Required attributes are not set for object %info.
ru: Для объекта %info не установлены обязательные атрибуты.

source: Key attribute value not set for object %info.
ru: Не задано значение ключевого атрибута для объекта %info.

source: Attribute %backAttr not found for back reference %backRef.
ru: Атрибут %backAttr не найден для обратной ссылки %backRef.

source: Async operation performed when calculation the default value for attribute %info.
ru: Асинхронная операция выполняется при вычислении значения по умолчанию для атрибута %info.

source: Not enough permissions for action
ru: Недостаточно разрешений для выполнения действия

source: Access level not enough for the action.
ru: Недостаточный уровень доступа для выполнения действия.

source: Class %class not found in namespace %namespace.
ru: Класс %class не найден в пространстве имен %namespace.

source: Attribute '%attr' not found in class '%class'.
ru: Атрибут '%attr' не найден в классе '%class'.

source: View '%view' not found.
ru: Представление '%view' не найдено.

source: Workflow '%workflow' not found.
ru: Бизнес-процесс '%workflow' не найден.

source: Invalid value assigned to attribute %class.%property.
ru: Атрибуту присвоено недопустимое значение %class.%property.

source: Attribute %class.%property value should be a number (fractional part should be separated with dot).
ru: Значение атрибута %class.%property должно быть числом (дробная часть должна быть отделена точкой).

source: Invalid date value assigned to attribute %class.%property.
ru: Недопустимое значение даты присвоено атрибуту %class.%property.

source: Attribute %class.%property value should be an integer number.
ru: Значение атрибута %class.%property должно быть целым числом.

source: Uniqueness of key '%key' of dataset '%table' is violated
ru: Нарушено уникальность ключа '%key' набора данных '%table'

source: Error in query.
ru: Ошибка в запросе.

source: Operation '%oper' was not applied to '%table' dataset.
ru: Операция '%oper' не была применена к набору данных '%table'.

source: Access level not enough to perform workflow transition '%trans'
ru: Уровень доступа недостаточен для выполнения перехода бизнес-процесса '%trans'

source: Transition '%trans' failed.
ru: Не удалось выполнить переход '%trans'.

source: Status '%state' of workflow '%workflow' not found.
ru: Статус '%state' бизнес-процесса '%workflow' не найден.

source: Object '%info' does not satisfy conditions of final state '%state' of workflow '%workflow'.
ru: Объект '%info' не удовлетворяет условиям конечного состояния '%state' бизнес-процесса '%workflow'.

source: Object '%info' is not in workflow '%workflow'.
ru: Объект'%info' отсутствует в бизнес-процессе '%workflow'.

source: Transition '%trans' of workflow '%workflow' is not allowed.
ru: Переход '%trans' бизнес-процесса '%workflow' не допускается.

source: Transition '%trans' of workflow '%workflow' not found.
ru: Переход '%trans' бизнес-процесса '%workflow' не найден.

source: Object is already in workflow '%workflow'
ru: Объект уже находится в бизнес-процессе '%workflow'

source: Condition %condition is not applicable to attribute %class.%attr.
ru: Условие %condition не применимо к атрибуту %class.%attr.

source: Attribute %class.%attr specified for condition is not found.
ru: Атрибут %class.%attr , указанный для условия, не найден.

source: Aggregation operation specification is invalid - class and attribute are not specified.
ru: Спецификация операции агрегации недопустима - класс и атрибут не указаны.

source: Invalid operation type
ru: Недопустимый тип операции

source: Invalid condition type
ru: Недопустимый тип условия

source: Operation arguments are not specified
ru: Аргументы операции не указаны

source: Invalid data format.
ru: Недопустимый формат данных.

source: Directory '%dir' not found.
ru: Каталог '%dir' не найден.

source: File '%file' not found.
ru: Файл '%file' не найден.

source: Field %field value is required
ru: Значение поля %field обязательно

source: Schedule started
ru: Расписание запущено

source: Model import successfully done
ru: Импорт модели успешно выполнен

source: Job name not specified
ru: Не указано название задания

source: Worker component not specified for job %s
ru: Не указан рабочий компонент для задания %s

source: Job %s not found
ru: Задание %s не найдено

source: Worker component of job %s not found
ru: Рабочий компонент задания %s не найден

source: Worker component of job %s has no launch method
ru: Рабочий компонент задания %s не имеет метода запуска

source: Job %s started
ru: Задание %s запущено

source: Job %s done
ru: Задание %s выполнено

source: Setup complete.
ru: Настройка завершена.

source: Export successfully done.
ru: Экспорт успешно завершен.

source: User successfully created.
ru: Пользователь успешно создан.

source: Data integrity checks are ignored
ru: Проверки целостности данных игнорируются

source: Import is successfully done.
ru: Импорт успешно выполнен.

source: Worker component for job %s is not specified
ru: Рабочий компонент для задания %s не указан

source: Parameters are not specified for job %s
ru: Не указаны параметры для задания %s

source: %s: Job %s was interrupted by timeout
ru: %s: Задание %s было прервано по таймауту

source: %s: Job %s started
ru: %s: Задание %s запущено

source: Worker component not found for background job %s
ru: Рабочий компонент не найден для фонового задания %s

source: Worker component of background job %s has no launch method
ru: Рабочий компонент фонового задания %s не имеет метода запуска

source: %s: Start of background job %s
ru: %s: Запуск фонового задания %s

source: %s: Background job %s done
ru: %s: Фоновое задание %s выполнено

source: No roles specified!
ru: Не задано ни одной роли!

source: No users nor resources nor permissions are specified!
ru: Ни пользователей, ни ресурсов, ни разрешений не указано!

source: Permissions granted
ru: Разрешения предоставлены

source: Access denied
ru: В доступе отказано

source: Sorry, but access to this resource is prohibited
ru: Извините, но доступ к этому ресурсу запрещен

source: Back to home
ru: Вернуться на главную
